_posts/2016-08-12-money-and-open-source.html
---
layout: post
title: Crowdfunding and open-source
excerpt: What is the right economic model for open-source software?
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Open-source ideals</h2>
<div class="outline-text-2" id="text-1">
<p>
Many software developers idealize "open-source"<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> software. Software that is open-source is considered higher-quality, more trustworthy, and even morally superior.
</p>

<p>
I tend to agree with these sentiments, particularly regarding the issue of trustworthiness. With proprietary software, it's all too easy to put in a quick hack&#x2013;or something more malicious&#x2013;without anyone knowing.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Matters of justice</h2>
<div class="outline-text-2" id="text-2">
<p>
Proponents of open-source software&#x2013;usually developers themselves&#x2013;often lament that it is "unjust" for some people to put in enormous time and effort in developing the software, and others to use it while contributing nothing. This is particularly intolerable when the users are from large companies that make millions, or billions, of dollars per year.
</p>

<p>
The problem, of course, is that allowing <i>everyone</i> to view the source code and use the software is a key plank of open-source idealism. I do not know of open-source software that places restrictions on users based on where they work or what type of company they work for&#x2013;and it's unclear whether such restrictions would stand up in a US court.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Making money</h2>
<div class="outline-text-2" id="text-3">
<p>
There are a few different approaches to making money off of open-source software:
</p>

<ul class="org-ul">
<li>Make the open-source software depend on proprietary software
</li>
<li>Have a separate license for commercial use
</li>
<li>Sell support (certification, consulting, etc.)
</li>
<li>Get sponsorship (from government agencies, corporations, etc.)
</li>
<li>Crowdfund
</li>
</ul>

<p>
Making open-source software depend on proprietary software is generally viewed as violating the "spirit of open-source", and is typically pursued by companies that want to be able to call themselves "open-source" without making a real commitment to it.
</p>

<p>
Having a separate license for commercial use is fairly common. Such software, however, tends to have more restrictive open-source licenses that preclude significant modification and redistribution, which <i>may</i> be viewed as violating the spirit of open-source.
</p>

<p>
Selling support tends to be favored by larger companies. There is a fundamental conflict of interest, however, in that the software <i>cannot be too easy to use</i>. Such software tends to be enterprise and monolithic, and suffer from "<a href="https://en.wikipedia.org/wiki/Not_invented_here">not invented here</a>" syndrome. In the extreme, products may be created <i>for the express purpose of selling support</i>; such products are rarely good.
</p>

<p>
Getting sponsorship removes the need to "sell", but may require "selling out" instead. Very basic sponsorship, such as displaying the sponsor's logo on the software's product page or mentioning the sponsor in blog posts and podcasts, may be enough to sustain a project with one or two developers. A larger project would requirement much more extensive sponsorship. In such cases, the sponsor may demand more&#x2013;early access to the code, for example, or even input in project direction.
</p>

<p>
Crowdfunding is a relatively new concept, and a route that is increasingly being taken by smaller projects and developers. The sums raised by crowdfunding are rarely enough to sustain even a single developer full-time. More often, the money is a "nice to have" that gives the developer <i>something</i>&#x2013;even if just a token of appreciation and support&#x2013;that motivates them to contribute spare time to a project.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">All about tradeoffs</h2>
<div class="outline-text-2" id="text-4">
<p>
In the end, there is no "right" approach to making money off of open-source software. The key questions are:
</p>

<ul class="org-ul">
<li>What aspects of open-source idealism can be sacrificed
</li>
<li>To what degree will sacrifices be made
</li>
<li>What the project will gain in return
</li>
</ul>

<p>
Ideally, the project establishes a set of <b>core value</b> at the beginning and maintains them. This way, the developers and users know what they're getting into from the start.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
I will use the term "open-source" to mean, in a general sense, software with available source code and a license that does not preclude using and modifying either. There are many types of "open-source" software out there, the details of which we will not get into.
</p></div>


</div>
</div>
